export default {
	languageChanged: "Добре, буду говорити українською.",

	welcome: {
		text: "Привіт, {{name}}! Мене звуть Ettie. Я можу допомогти тобі з різними завданнями, від відповідей на прості питання до надання докладних пояснень і обговорень різних тим.\nСо мною можна поговорити про що завгодно і отримати зрозумілі і актуальні відповіді.\nТи можеш налаштувати мене за допомогою кнопок нижче, щоб я могла допомогти тобі краще. Або ми можемо почати спілкування, просто задай мені питання.",
	},

	mainMenu: {
		translatorBtn: "🌍 Перекладач",
		historyBtn: "📚 Iсторія",
		subBtn: "💸 Підписка",
		langBtn: "🗺 Мова",
		historyListBtn: "📜 Отримати історію",
		delBtn: "❌ Видалити",
		translate:
			"Я використовую сторонній перекладач і за допомогою нього перекладаю твоє питання на англійську мову, після чого перекладаю свою відповідь на твою мову.\nТак я краще розумію ваші запитання.\nЯкщо ти хочеш-ти можеш включити або відключити його.\n⚠️ Але май на увазі - можуть з'явитися проблеми!",
		history:
			"Я зберігаю історію твоїх питань і моїх відповідей, щоб я могла зберігати зв'язність діалогу і відповісти тобі на твоє минуле питання.\nЯкщо ти хочеш-ти можеш включити або відключити її.\n⚠️ Але май на увазі - я не буду знати, про що ми спілкувалися раніше!",
		historyList: "Iсторія нашого діалогу:\n{{list}}",
		historyListEmpty: "Iсторія порожня.",
	},

	basic: {
		enabled: "☑️ Відключити",
		disabled: "❌ Включити",
		backBtn: "🔙 Назад",
		menuPlaceholder: "Привіт, {{name}}! Чим я можу тобі допомогти?",
		processing: "Думаю... 🤔 ",
	},

	errors: {
		unknown: "Сталася невідома помилка. Спробуйте ще раз.",
		setUpNeed: "Потрібно налаштувати мене, перш ніж ми почнемо спілкування. Напиши мені.",
		notSoFast: "Не так швидко! Зачекайте трохи, будь ласка.",
		voicePredict: "Під час розпізнавання мови сталася помилка. Спробуйте ще раз.",
		voiceIsEmptyOrTooLong:
			"Або ти нічого не сказав(-а), або ти сказав(-а) занадто багато. Спробуйте ще раз.",
		textTooSmallOrTooLong: "Питання занадто коротке або занадто довге. Спробуйте ще раз.",
	},
};
